{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": null,
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|im_end|>",
  "errors": "replace",
  "extra_special_tokens": [
    "<|im_start|>",
    "<|im_end|>",
    "<|object_ref_start|>",
    "<|object_ref_end|>",
    "<|box_start|>",
    "<|box_end|>",
    "<|quad_start|>",
    "<|quad_end|>",
    "<|vision_start|>",
    "<|vision_end|>",
    "<|vision_pad|>",
    "<|image_pad|>",
    "<|video_pad|>"
  ],
  "is_local": false,
  "local_files_only": false,
  "model_max_length": 131072,
  "pad_token": "<|endoftext|>",
  "response_schema": {
    "properties": {
      "content": {
        "type": "string"
      },
      "reasoning_content": {
        "type": "string"
      },
      "role": {
        "const": "assistant"
      },
      "tool_calls": {
        "items": {
          "properties": {
            "function": {
              "properties": {
                "arguments": {
                  "additionalProperties": {},
                  "type": "object"
                },
                "name": {
                  "type": "string"
                }
              },
              "type": "object"
            },
            "type": {
              "const": "function"
            }
          },
          "type": "object",
          "x-parser": "json",
          "x-parser-args": {
            "transform": "{type: 'function', function: @}"
          }
        },
        "type": "array",
        "x-regex-iterator": "<tool_call>\\s*(.+?)\\s*</tool_call>"
      }
    },
    "type": "object",
    "x-regex": "^(?:<think>\\n?(?:(?P<reasoning_content>.*?\\S.*?)\\n?|[\\s]*)</think>\\s*)?(?P<content>.*?)(?:\\n(?=<tool_call>))?(?=(?:<tool_call>|<\\|im_end\\|>|$))(?P<tool_calls>(?:<tool_call>.+?</tool_call>\\s*)+)?\\s*(?:<\\|im_end\\|>|$)"
  },
  "split_special_tokens": false,
  "tokenizer_class": "Qwen2Tokenizer",
  "unk_token": null
}
